Repository: sanduhrs/drupal-potx
Catalog: po/*.po
Languages: fr, ja

source: This page allows you to generate translation templates for module files. Select the module you wish to generate a template file for. A single Gettext Portable Object (Template) file is generated, so you can easily save it and start translation.
fr: Cette page vous permet de générer des modèles de traduction pour les fichiers d'un module. Sélectionnez le module pour lequel vous voulez un modèle. Un fichier Gettext Portable Object (modèle) sera généré ainsi vous pourrez facilement l'enregistrer et commencer la traduction.

source: Extract strings
fr: Extraire les chaînes de caractères
ja: 文字列の抽出

source: Language independent template
fr: Modèle indépendant du langage

source: Template file for !langname translations
fr: Fichier modèle pour les traductions en !langname

source: Template language
fr: Modèle de langage

source: Export a language independent or language dependent (plural forms, language team name, etc.) template.
fr: Exporter un modèle indépendant ou dépendant (formes plurielles, nom de l'équipe de traduction, etc) du langage.

source: Include translations
fr: Inclure les traductions

source: Include translations of strings in the file generated. Not applicable for language independent templates.
fr: Inclure les chaînes traduites dans le fichier généré. N'est pas applicable pour les modèles indépendants du langage.

source: Extract
fr: Extraire
ja: 抽出

source: You should select a module to export.
fr: Vous devez sélectionner un module à exporter.

source: Extract from %module_name module, in directory %dir_name
fr: Extraire à partir du module %module_name dans le répertoire %dir_name
ja: %dir_name 内の %module_name モジュールから抽出

source: Generates output from all files found in this directory.
fr: Génère une sortie pour tous les fichiers trouvés dans ce répertoire.
ja: このディレクトリで見つかった全ファイルから出力を生成します。

source: Extract from all modules in directory "@dir_name"
fr: Extraire pour tous les modules dans le répertoire "@dir_name"

source: To extract from a single module in this directory, choose the module entry in the fieldset below.
fr: Pour extraire à partir d'un unique module dans ce répertoire, choisir l'entrée de module dans la liste de champs ci-dessous.
ja: このディレクトリの単一モジュールから抽出するには、以下からモジュールを選んでください。

source: Modules in "@dir_name"
fr: Modules dans "@dir_name"

source: Extract from module %module_name
fr: Extraire à partir du module %module_name
ja: %module_name モジュールから抽出

source: Extract from files named %module_pattern, in directory %module_dir.
fr: Extraire à partir des fichiers nommés %module_pattern dans le répertoire %module_dir.
ja: %module_dir 内の %module_pattern ファイルから抽出します。

source: Translation template extractor
fr: Extracteur de modèle de traduction

source: Provides a web interface and an API to extract translatable text from the sources of installed components.
fr: Procure une interface web et une API pour extraire le texte traductible à partir des sources des composants installés.

source: Helps to extract pot-files for translations from the sources of installed modules.
ja: インストールされたモジュールのソースから、翻訳用の POT ファイルを抽出するのを支援します。

source: This page allows you to generate translation templates for module files. Select the module you wish to generate a template file for. A single Gettext Portable Object Template file is generated (unlike the output of the command line extractor utility), so you can easily save it and start translation.
ja: このページでモジュールファイルの翻訳用テンプレートの生成ができます。 テンプレートファイルを生成したいモジュールを選択してください。 コマンドラインの抽出ユーティリティとは違い、単一の PO ファイルが生成されるため、簡単に保存して翻訳を開始できます。

source: Extract from all modules in directory %dir_name
ja: %dir_name 内の全モジュールから抽出

source: Modules in %dir_name
ja: %dir_name 内のモジュール

source: POT extractor
ja: POTエキストラクター

source: Provides a web interface to extract Gettext templates from the sources of installed modules.
ja: インストールされたモジュールのソースからGettextテンプレートを抽出するウェブインターフェイスを提供します。
